app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def results
    @users = User.all.sort

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "108"]]
UPDATE "users" SET "phone" = '2123332323', "email" = 'sdf@sdf.com', "consent" = 'Yes', "updated_at" = '2013-10-20 17:34:10.766713' WHERE "users"."id" = 69490
---
  def update
    @user = User.find(params[:id])
    if params["zipcode"]
      @user.zipcode = params["zipcode"]
      @user.save!